By Nitish Adhikari

Email id :nitishbuzzpro@gmail.com, +91-9650740295

Linkedin : https://www.linkedin.com/in/nitish-adhikari-6b2350248

# Project : Create a 'School' database on PostgreSQL server using Jupyter Notebook IDE

A Data Scientist/ML/AI developer needs SQL in order to handle structured data. This structured data is stored in relational databases. Therefore, in order to query these databases, must have a sound knowledge of SQL.

In [ ]:
!pip install sqlalchemy
!pip install psycopg2
!pip install ipython-sql

In [1]:
import sqlalchemy

In [2]:
#create a postgresql engine
engine = sqlalchemy.create_engine('postgresql://postgres:*******@localhost:5432')

In [3]:
#load the sql extension
%load_ext sql

In [4]:
#Set up the connection
%sql $engine.url

## Create a new database called "School" this database should have two tables: teachers and students.

In [5]:
%sql COMMIT

 * postgresql://postgres:***@localhost:5432
Done.

[]

In [6]:
#Creating a new database
%sql CREATE DATABASE School

 * postgresql://postgres:***@localhost:5432
Done.

[]

In [11]:
#connect to database 'school'
%sql postgresql://postgres:*******@localhost:5432/school

## The students table should have columns for student_id, first_name,last_name, homeroom_number, phone,email, and graduation year.

In [23]:
%sql create table students(\
student_id serial primary key,\
first_name varchar(50) NOT NULL,\
last_name varchar(50) NOT NULL,\
homeroom_number smallint ,\
phone varchar(50) unique ,\
email varchar(50) unique ,\
graduation_year integer)

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/school
Done.

[]

In [24]:
#Showing the created 'students' table
%sql select * from students

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/school
0 rows affected.

[]

## The teachers table should have columns for teacher_id, first_name, last_name,homeroom_number, department, email, and phone.

In [20]:
%sql create table teachers(\
teacher_id serial primary key,\
first_name varchar(50) NOT NULL,\
last_name varchar(50) NOT NULL,\
homeroom_number smallint,\
phone varchar(50) unique,\
email varchar(50) unique,\
department varchar(50))

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/school
Done.

[]

In [21]:
#Showing the created 'teachers' table
%sql select * from teachers

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/school
0 rows affected.

[]

## insert a student named Mark Watney (student_id=1) who has a phone number of 777-555-1234 and doesn't have an email. He graduates in 2035 and has 5 as a homeroom number.

In [27]:
%sql insert into students(\
first_name,\
last_name,\
homeroom_number,\
phone,\
graduation_year)\
values(\
      'Mark',\
      'Watney',\
      5,\
      '777-555-1234',\
      2035)

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/school
1 rows affected.

[]

In [28]:
#Showing the created 'students' table
%sql select * from students

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/school
1 rows affected.

[(1, 'Mark', 'Watney', 5, '777-555-1234', None, 2035)]

## insert a teacher names Jonas Salk (teacher_id = 1) who as a homeroom number of 5 and is from the Biology department. His contact info is: jsalk@school.org and a phone number of 777-555-4321.

In [30]:
%sql insert into teachers(\
first_name,\
last_name,\
homeroom_number,\
phone,\
email,\
department)\
values(\
      'Jonas',\
      'Salk',\
      5,\
      '777-555-4321',\
      'jsalk@school.org',\
      'Biology')

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/school
1 rows affected.

[]

In [32]:
#Showing the created 'students' table
%sql select * from teachers

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/school
1 rows affected.

[(1, 'Jonas', 'Salk', 5, '777-555-4321', 'jsalk@school.org', 'Biology')]

# Complete!!